home/editor/emacs/init.org
#+title: My Emacs Config
#+author: marimo
#+STARTUP: fold

* 設定方針
** TODO Home-managerで管理する
[[https://apribase.net/2024/06/13/emacs-home-manager-init-org/]]

** CANCELED Leafに移行？
CLOSED: [2024-07-03 Wed 06:02]
[[https://github.com/conao3/leaf.el]]

** TODO zk-phi/setupの活用
コンパイル時計算を使う!
[[https://github.com/zk-phi/setup]]

** TODO コンパイルを使った高速化
[[https://github.com/nilcons/emacs-use-package-fast]]
load-pathをコンパイル時に解決することで、
package.elをロードしないようにして高速化する。

したがって、実際に設定するには、
1. パッケージをインストールするために直接生のinit.elを実行する
2. インストールできたらコンパイル
となる

コンパイルしたら実行時にはleafもpackageもロードされない

** TODO Dashboardをやめる
Dashboardを使うとOrgを読むので起動が遅い
なんならstartupも消しちゃうか
#+begin_src emacs-lisp
(setq inhibit-startup-screen t)
#+end_src

* early-init.el
:PROPERTIES:
:header-args: :tangle early-init.el :noweb yes
:END:
** UI
#+begin_src emacs-lisp
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars . nil) default-frame-alist)
#+end_src

** GCをとめる
#+begin_src emacs-lisp
(setq gc-cons-threshold most-positive-fixnum)
#+end_src

** backupとかlockとか
#+begin_src emacs-lisp
(setq make-backup-files nil)
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/backup/" t)))
(setq auto-save-timeout 10)
(setq auto-save-interval 100)
(setq auto-save-list-file-prefix nil)
(setq create-lockfiles nil)
#+end_src

** startupの諸々をとめる
#+begin_src emacs-lisp
(setq inhibit-startup-message t)
(setq inhibit-startup-buffer-menu t)
(setq inhibit-startup-screen t)
#+end_src

** X Resourcesをよまない
#+begin_src emacs-lisp
(setq inhibit-x-resources t)
#+end_src

** customizeでinit.elにかきこまない
#+begin_src emacs-lisp
(setq custom-file (locate-user-emacs-file "custom.el"))
(when (file-exists-p (expand-file-name custom-file))
  (load-file (expand-file-name custom-file)))
#+end_src

** package.elをとめる
#+begin_src emacs-lisp
(setq package-enable-at-startup nil)
#+end_src

** footer
#+begin_src emacs-lisp
(provide 'early-init)
#+end_src
* init.el
:PROPERTIES:
:header-args: :tangle init.el :noweb yes
:END:
** Header
#+begin_src emacs-lisp
;;; -*- lexical-binding: t -*-
#+end_src

** setup.el
#+begin_src emacs-lisp
(eval-when-compile
  (require 'setup)
  (setq setup-silent t
        setup-delay-interval 0.5
        setup-disable-magic-file-name t))
(setup-initialize)
#+end_src

** package.el
#+begin_src emacs-lisp
(eval-and-compile
  (setq package-archives '(("org" . "https://orgmode.org/elpa/")
                          ("melpa" . "https://melpa.org/packages/")
                          ("gnu" . "https://elpa.gnu.org/packages/"))
        package-install-upgrade-built-in t
        package-native-compile t)
  (mapc #'(lambda (add) (add-to-list 'load-path add))
        (eval-when-compile
          (require 'package)
          (package-initialize)
          (let ((package-user-dir-real (file-truename package-user-dir)))
            (nreverse (apply #'nconc
                             (mapcar #'(lambda (path)
                                         (if (string-prefix-p package-user-dir-real path)
                                             (list path)
                                           nil))
                                     load-path)))))))
#+end_src

*** ensure
- インタプリタで実行されるとき
- コンパイル時
にだけインストールする。
#+begin_src emacs-lisp
(eval-when-compile
  (defmacro ensure (pkg)
    (unless (package-installed-p pkg)
      `(package-install ,pkg)))
  (defmacro ensure-vc (arg)
    (unless (package-installed-p (car arg))
      `(package-install ,arg))))
#+end_src

** 標準の設定
*** パフォーマンスに関する設定
#+begin_src emacs-lisp
(setq process-adaptive-read-buffering t)
(setq blink-matching-paren nil)
(setq vc-handled-backends '(Git))
(setq auto-mode-case-fold nil)
(setq-default bidi-display-reordering 'left-to-right)
(setq bidi-inhibit-bpa t)
(setq-default cursor-in-non-selected-windows nil)
(setq highlight-nonselected-windows nil)
(setq fast-but-imprecise-scrolling t)
(setq idle-update-delay 1.0)
(setq redisplay-skip-fontification-on-input t)
(setq inhibit-compacting-font-caches t)
#+end_src

*** 行間の幅
#+begin_src emacs-lisp
(setq line-spacing 0.3)
#+end_src

*** Mac固有の設定
#+begin_src emacs-lisp
(!when (equal window-system 'mac)
  (setq mac-option-modifier 'meta
        mac-command-modifier 'super)
  (mac-auto-ascii-mode 1))
#+end_src
*** その他
#+begin_src emacs-lisp
(setq completion-cycle-threshold 3
      use-short-answers t)
#+end_src
** フォント設定
#+begin_src emacs-lisp
(defun my/set-font (size)
  (let* ((asciifont "UDEV Gothic 35JPDOC")
         (asciipropo "IBM Plex Sans JP")
         (jpfont "UDEV Gothic 35JPDOC")
         (h (* size 10))
         (fontspec (font-spec :family asciifont))
         (jp-fontspec (font-spec :family jpfont)))
    (set-face-attribute 'default nil :family asciifont :height h)
    (set-face-attribute 'fixed-pitch nil :family asciifont :height h)
    (set-face-attribute 'variable-pitch nil :family asciipropo :height h)
    (set-fontset-font t 'japanese-jisx0213.2004-1 jp-fontspec)
    (set-fontset-font t 'japanese-jisx0213-2 jp-fontspec)
    (set-fontset-font t 'katakana-jisx0201 jp-fontspec)
    (set-fontset-font t '(#x0080 . #x024F) fontspec)
    (set-fontset-font t '(#x0370 . #x03FF) fontspec)))
(if (display-graphic-p)
    (my/set-font 12))
#+end_src

** server
#+begin_src emacs-lisp
(setup "server"
  (unless (server-running-p)
    (server-start)))
#+end_src

** whitespace
#+begin_src emacs-lisp
(setup "whitespace"
  (setq whitespace-style '(face
                           trailing
                           tabs
                           spaces
                           empty
                           space-mark
                           tab-mark)
        whitespace-space-regexp "\\(\u3000+\\)"
        whitespace-trailing-regexp "\\([ \u00A0]+\\)$"
        whitespace-action '(auto-cleanup))
  (global-whitespace-mode 1))
#+end_src

** autorevert
#+begin_src emacs-lisp
(setup "autorevert"
  (setq auto-revert-avoid-polling t)
  (global-auto-revert-mode 1))
#+end_src

** subword
#+begin_src emacs-lisp
(setup-lazy '(subword-mode) "subword"
  :prepare (setup-hook 'prog-mode-hook #'subword-mode))
#+end_src

** tramp
#+begin_src emacs-lisp
(setup-after "tramp"
  (setq tramp-default-method "scpx")
  (add-to-list 'tramp-remote-path "/run/current-system/sw/bin")
  (add-to-list 'tramp-remote-path "/run/wrappers/bin"))
#+end_src
** comp
#+begin_src emacs-lisp
(setup-after "comp"
  (setq native-comp-async-report-warnings-errors 'silent))
#+end_src
** Fancy UI
*** Theme
ef-themesをつかう
#+begin_src emacs-lisp
(ensure 'ef-themes)
(setup "ef-themes"
  (setq ef-themes-mixed-fonts nil
        ef-themes-variable-pitch-ui nil)
  (load-theme 'ef-melissa-light t))
#+end_src

*** Modeline, Headerline
nano-modelineでheaderのみ設定
modelineは消す
#+begin_src emacs-lisp
(ensure 'nano-modeline)
(setup "nano-modeline"
  (setq nano-modeline-padding '(0.25 . 0.3)
        mode-line-format nil)
  (setup-after "meow"
    (defun nano-modeline-meow-state ()
      (propertize (meow-indicator)
                  'face (nano-modeline-face 'primary)))
    (defun my/nano-modeline-generic-mode (&optional default)
      "Generic Nano modeline"
      (funcall nano-modeline-position
               '((nano-modeline-meow-state)
                 (nano-modeline-buffer-status) " "
                 (nano-modeline-buffer-name) " "
                 (nano-modeline-git-info))
               '((nano-modeline-cursor-position)
                 (nano-modeline-window-dedicated))
               default))
    (my/nano-modeline-generic-mode t)))
#+end_src

*** perfect-margin
#+begin_src emacs-lisp
(ensure 'perfect-margin)
(setup "perfect-margin"
  (setq perfect-margin-ignore-filters nil)
  (perfect-margin-mode 1))
#+end_src

*** Icon
nerd-iconsを採用
#+begin_src emacs-lisp
(ensure 'nerd-icons)
(setup-after "nerd-icons"
  (ignore-errors (nerd-icons-set-font)))
#+end_src

#+begin_src emacs-lisp
(ensure 'nerd-icons-completion)
(setup-after "marginalia"
  (setup "nerd-icons-completion"
    (nerd-icons-completion-mode)
    (setup-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup)))
#+end_src
*** pixel-scroll
#+begin_src emacs-lisp
(setup "pixel-scroll"
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))
        mouse-wheel-progressive-speed nil
        mouse-wheel-follow-mouse t
        pixel-scroll-precision-large-scroll-height 40.0
        scroll-step 1)
  (pixel-scroll-precision-mode 1))
#+end_src

*** Parenthesis
#+begin_src emacs-lisp
(ensure 'rainbow-delimiters)
(setup-hook 'prog-mode-hook 'rainbow-delimiters-mode)
#+end_src
*** highlight line
#+begin_src emacs-lisp
(ensure 'lin)
(!-
 (setup "lin"
   (setq lin-face 'lin-blue)
   (lin-global-mode)))
#+end_src
** インデント
*** タブの挙動
#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
(setq-default tab-width 2)
#+end_src

*** highlight-indent-guides
#+begin_src emacs-lisp
(ensure 'highlight-indent-guides)
(setup-lazy '(highlight-indent-guides-mode) "highlight-indent-guides"
  (setq highlight-indent-guides-method 'bitmap
        highlight-indent-guides-character 124
        highlight-indent-guides-responsive 'top))
(setup-hook 'prog-mode-hook 'highlight-indent-guides-mode)
(setup-hook 'yaml-mode-hook 'highlight-indent-guides-mode)
#+end_src

