home/editor/emacs/init.el
;;; -*- lexical-binding: t -*-

(eval-when-compile
  (require 'setup)
  (setq setup-silent t
        setup-delay-interval 0.5
        setup-disable-magic-file-name t))
(setup-initialize)

(eval-and-compile
  (setq package-archives '(("org" . "https://orgmode.org/elpa/")
                          ("melpa" . "https://melpa.org/packages/")
                          ("gnu" . "https://elpa.gnu.org/packages/"))
        package-install-upgrade-built-in t
        package-native-compile t)
  (mapc #'(lambda (add) (add-to-list 'load-path add))
        (eval-when-compile
          (require 'package)
          (package-initialize)
          (let ((package-user-dir-real (file-truename package-user-dir)))
            (nreverse (apply #'nconc
                             (mapcar #'(lambda (path)
                                         (if (string-prefix-p package-user-dir-real path)
                                             (list path)
                                           nil))
                                     load-path)))))))

(eval-when-compile
  (defmacro ensure (pkg)
    (unless (package-installed-p pkg)
      `(package-install ,pkg)))
  (defmacro ensure-vc (arg)
    (unless (package-installed-p (car arg))
      `(package-install ,arg))))

(setq process-adaptive-read-buffering t)
(setq blink-matching-paren nil)
(setq vc-handled-backends '(Git))
(setq auto-mode-case-fold nil)
(setq-default bidi-display-reordering 'left-to-right)
(setq bidi-inhibit-bpa t)
(setq-default cursor-in-non-selected-windows nil)
(setq highlight-nonselected-windows nil)
(setq fast-but-imprecise-scrolling t)
(setq idle-update-delay 1.0)
(setq redisplay-skip-fontification-on-input t)
(setq inhibit-compacting-font-caches t)

(setq line-spacing 0.3)

(!when (equal window-system 'mac)
  (setq mac-option-modifier 'meta
        mac-command-modifier 'super)
  (mac-auto-ascii-mode 1))

(setq completion-cycle-threshold 3
      use-short-answers t)

(defun my/set-font (size)
  (let* ((asciifont "UDEV Gothic 35JPDOC")
         (asciipropo "IBM Plex Sans JP")
         (jpfont "UDEV Gothic 35JPDOC")
         (h (* size 10))
         (fontspec (font-spec :family asciifont))
         (jp-fontspec (font-spec :family jpfont)))
    (set-face-attribute 'default nil :family asciifont :height h)
    (set-face-attribute 'fixed-pitch nil :family asciifont :height h)
    (set-face-attribute 'variable-pitch nil :family asciipropo :height h)
    (set-fontset-font t 'japanese-jisx0213.2004-1 jp-fontspec)
    (set-fontset-font t 'japanese-jisx0213-2 jp-fontspec)
    (set-fontset-font t 'katakana-jisx0201 jp-fontspec)
    (set-fontset-font t '(#x0080 . #x024F) fontspec)
    (set-fontset-font t '(#x0370 . #x03FF) fontspec)))
(if (display-graphic-p)
    (my/set-font 12))

(setup "server"
  (unless (server-running-p)
    (server-start)))

(setup "whitespace"
  (setq whitespace-style '(face
                           trailing
                           tabs
                           spaces
                           empty
                           space-mark
                           tab-mark)
        whitespace-space-regexp "\\(\u3000+\\)"
        whitespace-trailing-regexp "\\([ \u00A0]+\\)$"
        whitespace-action '(auto-cleanup))
  (global-whitespace-mode 1))

(setup "autorevert"
  (setq auto-revert-avoid-polling t)
  (global-auto-revert-mode 1))

(setup-lazy '(subword-mode) "subword"
  :prepare (setup-hook 'prog-mode-hook #'subword-mode))

(setup-after "tramp"
  (setq tramp-default-method "scpx")
  (add-to-list 'tramp-remote-path "/run/current-system/sw/bin")
  (add-to-list 'tramp-remote-path "/run/wrappers/bin"))

(setup-after "comp"
  (setq native-comp-async-report-warnings-errors 'silent))

(ensure 'ef-themes)
(setup "ef-themes"
  (setq ef-themes-mixed-fonts nil
        ef-themes-variable-pitch-ui nil)
  (load-theme 'ef-melissa-light t))

(ensure 'nano-modeline)
(setup "nano-modeline"
  (setq nano-modeline-padding '(0.25 . 0.3)
        mode-line-format nil)
  (setup-after "meow"
    (defun nano-modeline-meow-state ()
      (propertize (meow-indicator)
                  'face (nano-modeline-face 'primary)))
    (defun my/nano-modeline-generic-mode (&optional default)
      "Generic Nano modeline"
      (funcall nano-modeline-position
               '((nano-modeline-meow-state)
                 (nano-modeline-buffer-status) " "
                 (nano-modeline-buffer-name) " "
                 (nano-modeline-git-info))
               '((nano-modeline-cursor-position)
                 (nano-modeline-window-dedicated))
               default))
    (my/nano-modeline-generic-mode t)))

(ensure 'perfect-margin)
(setup "perfect-margin"
  (setq perfect-margin-ignore-filters nil)
  (perfect-margin-mode 1))

(ensure 'nerd-icons)
(setup-after "nerd-icons"
  (ignore-errors (nerd-icons-set-font)))

(ensure 'nerd-icons-completion)
(setup-after "marginalia"
  (setup "nerd-icons-completion"
    (nerd-icons-completion-mode)
    (setup-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup)))

(setup "pixel-scroll"
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))
        mouse-wheel-progressive-speed nil
        mouse-wheel-follow-mouse t
        pixel-scroll-precision-large-scroll-height 40.0
        scroll-step 1)
  (pixel-scroll-precision-mode 1))

(ensure 'rainbow-delimiters)
(setup-hook 'prog-mode-hook 'rainbow-delimiters-mode)

(ensure 'lin)
(!-
 (setup "lin"
   (setq lin-face 'lin-blue)
   (lin-global-mode)))

(setq-default indent-tabs-mode nil)
(setq-default tab-width 2)

(ensure 'highlight-indent-guides)
(setup-lazy '(highlight-indent-guides-mode) "highlight-indent-guides"
  (setq highlight-indent-guides-method 'bitmap
        highlight-indent-guides-character 124
        highlight-indent-guides-responsive 'top))
(setup-hook 'prog-mode-hook 'highlight-indent-guides-mode)
(setup-hook 'yaml-mode-hook 'highlight-indent-guides-mode)
