home/editor/emacs/init.el

(ensure 'aggressive-indent)
(setup-hook 'emacs-lisp-mode 'aggressive-indent-mode)

(setup-hook 'prog-mode-hook 'electric-indent-mode)

(ensure 'vertico)
(ensure 'marginalia)
(setup-lazy '(vertico--advice) "vertico"
  :prepare (progn
             (advice-add 'completing-read-default :around 'vertico--advice)
             (advice-add 'completing-read-multiple :around 'vertico--advice))
  (setq vertico-cycle t)

  (setup "orderless")
  (setup "savehist")
  (setup "marginalia" (marginalia-mode))
  (setup-keybinds vertico-map
    "<backspace>" '("vertico-directory" vertico-directory-delete-char))

  (defvar +vertico-current-arrow t)
  (cl-defmethod vertico--format-candidate :around
    (cand prefix suffix index start &context ((and +vertico-current-arrow
                                                   (not (bound-and-true-p vertico-flat-mode)))
                                              (eql t)))
    (setq cand (cl-call-next-method cand prefix suffix index start))
    (if (bound-and-true-p vertico-grid-mode)
        (if (= vertico--index index)
            (concat (nerd-icons-faicon "nf-fa-hand_o_right") " " cand)
          (concat #("_" 0 1 (display " ")) cand))
      (if (= vertico--index index)
          (concat " " (nerd-icons-faicon "nf-fa-hand_o_right") " " cand)
        (concat "    " cand)))))

(setup-lazy '(vertico-repeat-save) "vertico-repeat"
  :prepare (setup-hook 'minibuffer-setup-hook
             (vertico-repeat-save)))

(ensure 'consult)
(setup-lazy
  '(consult-recent-file
    consult-outline
    consult-line
    consult-buffer
    consult-imenu
    consult-yank-pop)
  "consult"
  (setq consult-preview-key 'any))

(ensure 'embark)
(ensure 'embark-consult)
(setup-lazy
  '(embark-act
    embark-dwim
    embark-bindings)
  "embark"
  :prepare (setup-keybinds nil
             "C-." 'embark-act
             "M-." 'embark-dwim
             "C-h B" 'embark-bindings)
  (setup-after "consult"
    (setup "embark-consult"
      (setup-hook 'embark-collect-mode-hook
        'consult-preview-at-point-mode))))

(ensure 'orderless)
(setup-after "orderless"
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))

(ensure 'corfu)
(ensure 'corfu-terminal)
(ensure 'cape)
(ensure 'nerd-icons-corfu)
(!-
 (setup "corfu"
   (setup "orderless")
   (setq corfu-auto t
         corfu-auto-prefix 2
         corfu-cycle t
         corfu-preselect 'prompt
         corfu-quit-no-match t
         corfu-quit-at-boundary nil
         corfu-scroll-margin 2
         tab-always-indent 'complete)

   (unless (display-graphic-p)
     (setup "corfu-terminal"
       (corfu-terminal-mode 1)))

   (setup "corfu-popupinfo"
     (setup-hook 'corfu-mode-hook #'corfu-popupinfo-mode))

   (setup "nerd-icons-corfu"
     (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

   (setup "cape"
     (add-to-list 'completion-at-point-functions #'cape-dabbrev)
     (add-to-list 'completion-at-point-functions #'cape-file)
     (add-to-list 'completion-at-point-functions #'cape-keyword))

   (global-corfu-mode 1)

   (setup-keybinds corfu-map
     "<tab>" 'corfu-next
     "<backtab>" 'corfu-prev
     "<remap> <next-line>" nil
     "<remap> <prev-line>" nil)))

(ensure 'tempel)
(setup-lazy '(tempel-complete
              tempel-expand
              tempel-setup-capf)
  "tempel"
  (setup-after "eglot"
    (setup "eglot-tempel"))
  (defun tempel-setup-capf ()
    (setq-local completion-at-point-functions
                (cons #'tempel-complete
                      completion-at-point-functions)))
  (add-hook 'conf-mode-hook #'tempel-setup-capf 90)
  (add-hook 'prog-mode-hook #'tempel-setup-capf 90)
  (add-hook 'org-mode-hook #'tempel-setup-capf 90)
  (add-hook 'text-mode-hook #'tempel-setup-capf 90))

(ensure 'tempel)
(setup-after "eglot-tempel"
  (eglot-tempel-mode))

(ensure 'undo-fu)
(ensure 'vundo)
(setup-after "vundo"
  (setq vundo-glyph-alist vundo-unicode-symbols))

(ensure 'expreg)

(ensure 'meow)
(setup "meow"
  (setq meow-cursor-type-insert '(bar . 3)
        meow-use-cursor-position-hack t
        meow-selection-command-fallback
        '((meow-change . meow-change-char)
          (meow-kill . meow-delete)
          (meow-cancel-selection . keyboard-quit)
          (meow-pop-selection . meow-pop-grab)
          (meow-beacon-change . meow-beacon-change-char)))
  (setq meow-char-thing-table
        '((?\( . round)
          (?\[ . square)
          (?\{ . curly)
          (?\< . angle)
          (?` . backquote)
          (?\' . quote)
          (?\" . wquote)
          (?s . line)
          (?b . buffer)
          (?g . string)
          (?p . paragraph)))
  
  (meow-thing-register 'angle
                       '(pair ("<") (">"))
                       '(pair ("<") (">")))
  (meow-thing-register 'quote
                       '(pair ("'") ("'"))
                       '(pair ("'") ("'")))
  (meow-thing-register 'wquote
                       '(pair ("\"") ("\""))
                       '(pair ("\"") ("\"")))
  (meow-thing-register 'backquote
                       '(pair ("`") ("`"))
                       '(pair ("`") ("`")))
  (meow-thing-register 'org-md-block
                     '(regexp "^[ \\|\t]*\\(#\\+begin_\\|```\\)[^\n]*\n" "^[ \\|\t]*\\(#\\+end_[^\n]*\\|```\\)$")
                     '(regexp "^[ \\|\t]*\\(#\\+begin_\\|```\\)[^\n]*\n" "^[ \\|\t]*\\(#\\+end_[^\n]*\\|```\\)$")
                     )
  (meow-thing-register 'inline-math
                       '(pair ("\\(") ("\\)"))
                       '(pair ("\\(") ("\\)")))
  (meow-thing-register 'display-math
                       '(pair ("\\[") ("\\]"))
                       '(pair ("\\[") ("\\]")))
  
  
  (setup-hook 'org-mode-hook
    (setq-local meow-char-thing-table
                (cons meow-char-thing-table
                      '(?o . org-md-block))))
  (setup-hook 'markdown-mode-hook
    (setq-local meow-char-thing-table
                (cons meow-char-thing-table
                      '(?o . org-md-block))))
  (add-to-list 'insert-pair-alist '(?$ "\\(" "\\)"))
  
  (defun insert-pair-region (start end char)
    (interactive
     (list (region-beginning) (region-end)
           (read-char "Wrapping Char (command): ")))
    (let* ((pair (or (assoc char insert-pair-alist)
                     (rassoc (list char) insert-pair-alist)))
           (open (cond ((and pair (nth 2 pair)) (nth 1 pair))
                       (pair (nth 0 pair))
                       (t char)))
           (close (cond ((and pair (nth 2 pair)) (nth 2 pair))
                        (pair (nth 1 pair))
                        (t char))))
      (save-excursion
        (goto-char start)
        (setq start (point-marker))
        (goto-char end)
        (setq end (point-marker))
        (goto-char start)
        (insert open)
        (goto-char end)
        (insert close))
      (goto-char start)))
  
  (defun meow-surround-squeeze ()
    (interactive)
    (let* ((ch (meow-thing-prompt "Delete thing: "))
           (inner (meow--parse-inner-of-thing-char ch))
           (outer (meow--parse-bounds-of-thing-char ch)))
      (delete-region (cdr inner) (cdr outer))
      (kill-region (car inner) (cdr inner))
      (delete-region (car outer) (car inner))))
