home/editor/emacs/init.el
  (defun meow-setup ()
    (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
    (meow-motion-overwrite-define-key
     '("j" . meow-next)
     '("k" . meow-prev)
     '(";" . main-hydra/body)
     '("<escape>" . ignore))
    (meow-leader-define-key
     ;; SPC j/k will run the original command in MOTION state.
     '("j" . "H-j")
     '("k" . "H-k")
     ;; Use SPC (0-9) for digit arguments.
     '("1" . meow-digit-argument)
     '("2" . meow-digit-argument)
     '("3" . meow-digit-argument)
     '("4" . meow-digit-argument)
     '("5" . meow-digit-argument)
     '("6" . meow-digit-argument)
     '("7" . meow-digit-argument)
     '("8" . meow-digit-argument)
     '("9" . meow-digit-argument)
     '("0" . meow-digit-argument)
     '("/" . meow-keypad-describe-key)
     '("?" . meow-cheatsheet))
    (meow-normal-define-key
     '("0" . meow-expand-0)
     '("9" . meow-expand-9)
     '("8" . meow-expand-8)
     '("7" . meow-expand-7)
     '("6" . meow-expand-6)
     '("5" . meow-expand-5)
     '("4" . meow-expand-4)
     '("3" . meow-expand-3)
     '("2" . meow-expand-2)
     '("1" . meow-expand-1)
     '("-" . meow-reverse)
  
     ;; basic
     '("h" . meow-left)
     '("j" . meow-next)
     '("k" . meow-prev)
     '("l" . meow-right)
  
     '("H" . meow-left-expand)
     '("J" . meow-next-expand)
     '("K" . meow-prev-expand)
     '("L" . meow-right-expand)
  
     '("i" . meow-insert)
     '("I" . meow-open-above)
     '("a" . meow-append)
     '("A" . meow-open-below)
     '("q" . meow-quit)
  
     ;; selection
     '("v" . meow-line)
     '("V" . set-mark-command)
  
     '("o" . expreg-expand)
     '("m" . meow-join)
  
     '("e" . meow-next-word)
     '("E" . meow-next-symbol)
     '("b" . meow-back-word)
     '("B" . meow-back-symbol)
     '("w" . meow-mark-word)
     '("W" . meow-mark-symbol)
  
     '("," . meow-inner-of-thing)
     '("." . meow-bounds-of-thing)
     '("<" . meow-beginning-of-thing)
     '(">" . meow-end-of-thing)
  
     '("g" . meow-grab)
     '("G" . meow-cancel-selection)
  
     '("t" . meow-find)
     '("T" . meow-till)
  
     ;; editing
     '("d" . meow-kill)
     '("c" . meow-change)
     '("v" . meow-yank)
     '("V" . consult-yank-pop)
  
     '("r" . meow-replace)
     '("R" . meow-swap-grab)
  
     '("p" . meow-yank)
     '("P" . consult-yank-pop)
     '("y" . meow-save)
     '("Y" . meow-save-clipboard)
  
     '("u" . undo-fu-only-undo)
     '("U" . undo-fu-only-redo)
  
     '("=" . indent-region)
  
     '("se" . insert-pair-region)
     '("sd" . meow-surround-squeeze)
  
     ;; command
     '("/" . consult-line)
     '(";" . main-hydra/body)
     '("ss" . major-mode-hydra)
     '("n" . vertico-repeat)
     '("f" . avy-goto-word-1)
     '("F" . avy-hydra/body)
     ;; ignore escape
     '("<escape>" . ignore)))
  (meow-setup)
  (meow-global-mode)
  )

(ensure 'meow-tree-sitter)
(setup "meow-tree-sitter"
  (meow-tree-sitter-register-defaults))

(ensure 'which-key)
(!-
 (setup "which-key"
   (setq which-key-idle-delay 0.5
         which-key-show-early-on-C-h t)))

(ensure 'hydra)
(ensure 'major-mode-hydra)

(provide 'init)
